OdDAI.Schema.getGlobalRules
\details
Retrieves the array with schema global rules.
\returns An array with schema global rules.

OdDAI.Schema.validateGlobalRule(OdSmartPtr&lt;OdDAI.Model&gt;!System.Runtime.CompilerServices.IsConst,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdDAI.List&lt;OdAnsiString&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Validates model if it satisfies global rule with ruleName.
\returns OdDAI::Logical::True if model satisfies Global Rule.

OdDAI.Schema.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.Schema.getSuperEntityCollection(OdSmartPtr&lt;OdDAI.Entity&gt;!System.Runtime.CompilerServices.IsConst,std.list&lt;OdSmartPtr&lt;OdDAI.Entity&gt;,std.allocator&lt;OdSmartPtr&lt;OdDAI.Entity&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the supertypes collection starting from a specified entity definition.
The method fills a passed entity list and returns it to a calling subroutine.
\param targetEntity     [in]  A smart pointer to the starting entity definition.
\param collectionToFill [out] A placeholder for the supertypes collection.

OdDAI.Schema.namedType(OdAnsiString)
\details
Finds an entity or type definition by its name.
\returns Returns a smart pointer to the named type of found entity or type definition. If the entity or type are not found, the method returns a NULL smart pointer.

OdDAI.Schema.find(OdAnsiString)
\details
Finds an entity definition by its name.
\returns Returns a smart pointer to the found entity definition. If the entity is not found, the method returns a NULL smart pointer.

OdDAI.Schema.types
\details
Retrieves a set of defined types of the schema.
\returns Returns a set of defined types of the schema.

OdDAI.Schema.entities
\details
Retrieves a set of entity definitions of the schema.
\returns Returns a set of entity definitions of the schema.

OdDAI.Schema.name
\details
Retrieves the name of the schema.
\returns Returns the name of the schema.